9# 身体是革命的本钱，只有随时保持最好的状态，才能好好学习


# 不同的环境，总是能有最佳的解决方案，然后必须遵守

# 例如，我根据学校专门定制的场景，能达到 11 个小时的学习时间，这就是最长的时间。
# 你要去弄补修表，还是做学校任务，都是算入 11 个小时里面的，这是固定的。
# 所以，没有必要逃避，没有必要为了刷自学时长而刷自学时长，活动时间根据环境早就规划好的。


* TODO 时间管理 [0/1]
** TODO 学校 [0/2] 
*** TODO 最完美状态
- 要求
    - 不追求短期目标，为长期目标
        - 学英语
        - 多思考提升的方法
        - 安排考试，晚修训练
    - 学习高效率
        - 自学为主，与现有的知识体系融合容易
        - 兴趣为主，积极性更高
        - 更多的时间，更少的 kpi, 得以去思考核心问题，而不是完成需求的机器
    - 重视身体
        - 一定会有 *足够的时间* 锻炼身体
            - 锻炼时间
            - 锻炼前的缓冲时间，保证不是疲劳状态，影响积极性

        - 不熬夜
          我多次的经验表明，为了完成紧急临时任务而熬夜，不仅效率低，一晚上学不到什么，而且还会严重影响第二天精神，结果浪费更多时间。

          而且熬夜一般是赶进度，是自己时间管理能力低下的表现

        - 能够固定的三餐时间
    - 轻松，人生不就是图个轻松吗？

- 全天时间划分
  | 起床  |  6:40 |
  | 晨跑  |  6:55 |
  | 早餐  |  7:20 |
  | 早修  |  8:00 |
  | 午饭  | 12:00 |
  | 插修1 | 12:40 |
  | 午睡  | 13:25 |
  | 中修  | 14:00 |
  | 放松1 | 16:30 |
  | 运动  | 17:00 |
  | 晚饭  | 17:35 |
  | 洗澡  | 18:10 |
  | 插修2 | 18:30 |
  | 晚修  | 19:00 |
  | 放松2 | 23:00 |
  | 晚睡  | 24:00 |

- 归类后
  学习
  | 最大  | 8:00-23：00 | 11 小时 |
  | 早修  |  8:00-12:00 | 4小时   |
  | 中修  | 14:00-16:00 | 2小时   |
  | 晚修  | 19:00-23:00 | 4小时   |
  | 插修1 | 12:00-12:30 | 30分钟  |
  | 插修2 | 18:30-19:00 | 30分钟  |
  运动
  | Max  | xx:xx-xx:xx | 55 |
  | 早上 | 06:55-07:10 | 15 |
  | 下午 | 07:00-17:35 | 35 |
  睡眠
  | Max  |             | 7 小时      |
  | 晚上 |  00:00-6:40 | 6小时40分钟 |
  | 中午 | 13:25-13:45 | 20 分钟     |
  可以极限压缩的，可利用时间
  | Max   |             | 2 小时  |
  | 早餐  |   7:30-8:00 | 30 分钟 |
  | 午饭  | 12:30-13:00 | 30 分钟 |
  | 晚饭  | 17:40-18:10 | 30 分钟 |
  | 放松1 | 16:30-17:00 | 30 分钟 |
  必须要做养生疗法
  | Max   |             | 1 小时 |
  | 放送2 | 23:00-23:59 | 1 小时 |
  利用情况
  | 全部可统计时间 | 21 小时 |
  | 消耗情况       | 3 小时  |
  | 有效可利用率   | 87.5%   |

  : 为什么我全部安排了 A 事件？？？？？？？？？？？？

  因为我发现，如果没有一个按照一个规章，那么谈何计划？

  我突然想去吃饭，吃玩饭又困，又想睡觉，对吧，然后你还觉得自己很勤奋？

  你的 a 事件，做不完是因为时间不够。但是这已经是最高效率，能挤出最多的时间了。如果你遵循不了，a 事件铁定玩不成，所以我把 a 事件的前置条件做为 a 事件
**** TODO [#A] 运动1
DEADLINE: <2022-11-12 Sat 07:10 +1d> SCHEDULED: <2022-11-12 Sat 06:50 +1d>
:PROPERTIE:LAST_REPEAT: [2022-11-11 Fri 07:59]S:

:END:
  失败：
  - 直接原因：还在为晚上没有睡好的事情懊恼，
  - 根本原因：没有足够的思想领悟，既定目标，一条路过去的决心。
**** TODO [#A] 早餐
DEADLINE: <2022-11-12 Sat 07:50 +1d> SCHEDULED: <2022-11-12 Sat 07:20 +1d>
:PROPERTIE:LAST_REPEAT: [2022-11-11 Fri 07:59]S:

:END:
- CLOSING NOTE [2022-11-07 Mon 09:21] \\
  - 失败
      - 直接原因：（1）运动1 延迟，造成的连锁反映，（2）要去做核酸
**** LOOP [#A] 早修
DEADLINE: <2022-11-11 Fri 11:59 +1d> SCHEDULED: <2022-11-11 Fri 08:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 15:14]
:END:
**** TODO [#A] 午餐
DEADLINE: <2022-11-11 Fri 12:55 +1d> SCHEDULED: <2022-11-11 Fri 12:30 +1d>
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:14]S:

:END:
**** TODO [#A] 插修1
DEADLINE: <2022-11-11 Fri 12:25 +1d> SCHEDULED: <2022-11-11 Fri 12:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 17:17]
:END:
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:16]S:

:END:
**** TODO [#A] 午觉
DEADLINE: <2022-11-11 Fri 13:55 +1d> SCHEDULED: <2022-11-11 Fri 13:25 +1d>
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:14]S:

:END:
**** TODO [#A] 中修
DEADLINE: <2022-11-11 Fri 16:30 +1d> SCHEDULED: <2022-11-11 Fri 14:05 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 17:17]
:END:
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:16]S:

:END:
**** TODO [#A] 插修2
DEADLINE: <2022-11-11 Fri 19:00 +1d> SCHEDULED: <2022-11-11 Fri 18:35 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 19:27]
:END:
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:16]S:

:END:
**** TODO [#A] 运动2
DEADLINE: <2022-11-11 Fri 17:30 +1d> SCHEDULED: <2022-11-11 Fri 17:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 18:46]
:END:
:LOGBOOK:
CLOCK: [2022-11-10 Thu 17:17]--[2022-11-10 Thu 17:35] =>  0:18
:END:
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:16]S:

:END:
**** TODO [#A] 晚餐
DEADLINE: <2022-11-11 Fri 18:00 +1d> SCHEDULED: <2022-11-11 Fri 17:35 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 18:46]
:END:
:LOGBOOK:
CLOCK: [2022-11-10 Thu 17:40]--[2022-11-10 Thu 18:05] =>  0:25
:END:
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:16]S:

:END:
**** TODO [#A] 洗衣服洗澡
DEADLINE: <2022-11-11 Fri 18:30 +1d> SCHEDULED: <2022-11-11 Fri 18:05 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 18:47]
:END:
:LOGBOOK:
CLOCK: [2022-11-10 Thu 18:25]--[2022-11-10 Thu 18:45] =>  0:20
:END:

:END:
**** TODO [#A] 晚修
DEADLINE: <2022-11-11 Fri 22:58 +1d> SCHEDULED: <2022-11-11 Fri 19:05 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 22:57]
:END:
:PROPERTIE:LAST_REPEAT: [2022-11-10 Thu 17:16]S:

:END:
DEADLINE: <2022-11-10 Thu 23:55 +1d> SCHEDULED: <2022-11-10 Thu 23:00 +1d>

:END:
DEADLINE: <2022-11-13 Sun 06:40 +1d> SCHEDULED: <2022-11-12 Sat 00:05 +1d>

:END:

- 大纲
    - 除了早，中，晚修之外，其余时间全部变为灵活处理时间，用于处理突发紧急事件，
        - 例如，太累了，多睡会
        - PPT 没写完，不敢去上课

    - 以完成任务为一切优先
        - 停止一切自学
        - 停止训练

    - 不要太注重学习效率
        - 作业能抄就抄

        - 知识体系围绕任务为核心
            - 不要管前置知识
            - 不要管是否与现有知识体系冲突

        - 资料以他们为准
            - 反面例子：操作系统考试，学会了各种调度算法，结果还是不能过
            - 正面例子：根据学委发的资料，用 org 理解一遍，复习了几天，结果考试做的最快。

- 时间安排（变动）
  : 在 *完美安排* 的基础上，把非学习时间挤出来。也就是不再强制要求运动，吃早餐，虽然这样对学习效率提高毫无作用，只用在必须赶进度的情况

    - 挤出时间 (3 个半小时）
        - 啃面包  (1 个半小时）
        - 运动时间可以取消： 1 个小时
        - 23:00 - 24:00 的时间可以利用 : 1 个小时

    - 用命来换，并不会提高效率
        - 超过 24:00 不睡觉 (上午要 commit）
        - 不睡午觉         （下午要 commit）


* TODO 身体的潜能秘密 [0/10]
: 没有时间划分，也就是不用花费你的时间。但是要遵循的规范！！！
** TODO [#A] 规范：晚餐：吃大量碳水和多肉
SCHEDULED: <2022-11-11 +1d>
多肉是肯定的，但是碳水不够的话，晚上还是饿到不行。
** TODO [#A] 规范：睡觉前半小时不能进行脑力活动（对换插修和午饭时间）
SCHEDULED: <2022-11-11 +1d>

** TODO [#A] 规范：中餐：多吃碳水，确保回来直接睡觉
SCHEDULED: <2022-11-11 +1d>
** TODO [#A] 规范：早餐一定不能吃碳水，最好吃饺子，有条件一定要和咖啡
SCHEDULED: <2022-11-12 +1d>
中午：因为睡午觉的关系，只要能撑到 13-20 之前就行了。
晚上：必定吃碳水：因为能量不够，影响晚上的睡眠。

但是，早上是刚刚起床，精力最充沛的事情，怎么能犯困呢？自己的体质问题一定要想办法去克服

** TODO [#A] 规范：确保过去一天，在有任务的时间段，时刻携带并且能够打开电脑，并且做到任务准时严格执行
SCHEDULED: <2022-11-11 Fri +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 22:57]
:END:

:END:


SCHEDULED: <2022-11-10 Thu +1d>
:END:
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 22:59]
:END:
:END:
**** TODO [#A] 将来：加入新的任务
SCHEDULED: <2022-11-10 Thu +1d>
:END:
SCHEDULED: <2022-11-10 Thu +1d>
:END:
**** TODO [#A] 过去：调整 deadline
SCHEDULED: <2022-11-10 Thu +1d>
:END:
SCHEDULED: <2022-11-10 Thu +1d>
:END:
SCHEDULED: <2022-11-13 Sun +1w>
:PROPERTIES:
:LAST_REPEAT: [2022-11-07 Mon 09:24]
:END:

** TODO [#A] 生火
SCHEDULED: <2022-11-11 Fri +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 22:22]
:END:
:END:

** TODO [#A] 遗精只是我人生中一个非常小的挫折而已，不要怕，勇敢地去面对它，我迟早会攻克它，在此之前，不要沮丧，迟早会赢。
- [X] 第 0 阶段：什么方法都不去找，不肯面对，等死
- [X] 第一阶段：社区林+积极锻炼+合理的生活习惯和规划
  因为没有钱，和时间，和资源，什么都没有去看望医生，查找答案。所以暂时的妥协
- [ ] 中医阶段
** TODO [#A] 保持你的愤怒，只要你知道自己想要什么，就不会被淫邪影响。
** 防止遗精的措施 [0/1]
: 社区林大概是 1-2 个月的有效控制范围，所以遵循以下措施可以保持在正常人范围内
: 所以，有两次不全是盖被子（用桌子顶住的虚盖）的问题，是本来到极限范围了。
*** 血的教训 [0/4]
**** TODO [#A] 中午午睡，就算睡 10 分钟，都必须把衣服穿好，不能把它当被子盖
SCHEDULED: <2022-11-11 Fri +1d>
:END:
SCHEDULED: <2022-11-10 Thu +1d>
:END:
SCHEDULED:<2022-11-14 +1d>
**** TODO [#A] 晚上必须在 6 点 30 分钟前吃饭 (我算过的极限时间，考虑 6 点下课的情况），如果超过 6 点半，则晚上什么都不能吃
SCHEDULED: <2022-11-11 Fri +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-11-10 Thu 22:22]
:END:

:END:

**** TODO [#A] 睡前：每天晚上睡觉前拿湿的毛巾，敷 20 分钟以上
SCHEDULED: <2022-11-10 Thu +1d>
:END:
**** TODO [#A] 每次看到色情内容一定要主动远离
SCHEDULED: <2022-11-11 Fri +1d>
**** TODO [#A] 晚上不要喝奶茶或任何饮料（喝汤或一杯水最好）
SCHEDULED: <2022-11-14 +1d>
**** TODO [#A] 把龟头尽可能透气，减少敏感度，别动不动就春梦
SCHEDULED: <2022-11-14 +1d>
这个真的是血的教训啊，2 个月前就知道的事情，因为不想穿内裤去上课（嫌麻烦），洗麻烦，换麻烦，结果铸成大错
** 饮食计划

** 睡眠安排
** 锻炼方式
*** 公路车
+ 传统的低齿轮比是否可以代替健身房的深蹲作为力量训练
  答案是不可以，因为很简单，研究表明，效率很低，自由骑行最好。

*** 深蹲
**** 好处：力量和耐力的提高
: 研究表明，深蹲不仅对短跑等力量运动，而且对耐力运动有提高。
- 力量训练对耐力的减少是缺乏证据的
- 因为，力量提高一倍的同时，*肱四头肌* 并没有增加两倍。力量的提高更多的是提高了神经募集能力，所以深蹲对耐力减少是缺乏依据的。
**** 动作次数
***** 基本框架
- 力量 : < 6
- 肌肉 : > 6 && < 12
- 耐力 : > 12
***** 公路车的特化要求：做力量组 : < 6 次
按理说，公路车是 *耐力为主* 的运动，次数 > 12 ，最好是 15 - 25 以上。
但是平常的骑行就是上千次的深蹲，所以耐力训练没有什么好做的了。（这逻辑，感觉很奇妙，但是又有点道理）


